# Sesión 4 Pandas Tipos operaciones

In [7]:
import numpy as np
import pandas as pd

from datetime import date, time, datetime
from datetime import timedelta


* ```object``` el cual representa a una cadena de caracteres.
* ```int64``` es el tipo para números enteros. 
* ```float64``` es el tipo para números de punto flotante.
* ```bool``` es el tipo para valores booleanos.
* ```datetime64``` es el tipo usado para gestionar fechas y horas.
* ```timedelta``` es el tipo de diferencias de tiempo. 
* ```category``` es un tipo de dato que contiene una colección finita de posibles valores

## Funciones de fecha

pd.datetime() año, mes, día, hora, minuto, segundo

In [8]:
datos = pd.DataFrame({'nombres':('Carlos Ayala',
                                 'Martha Sánchez'
                                 , 'Jimena Ríos',
                                 'Raul Quiroz'),
            'fechas':(date(year=1995, month=12, day=21), 
                      date(year=1989, month=1, day=13), 
                      date(year=1992, month=9, day=14), 
                      date(year=1993, month=7, day=8)),
            'saldo': (3600, 
                      7452, 
                      np.NaN, 
                      12143.5),
            'al corriente':(True, 
                            True, 
                            False, 
                            True)})

datos

          nombres      fechas    saldo  al corriente
0    Carlos Ayala  1995-12-21   3600.0          True
1  Martha Sánchez  1989-01-13   7452.0          True
2     Jimena Ríos  1992-09-14      NaN         False
3     Raul Quiroz  1993-07-08  12143.5          True

Convertir un objecto de pandas a un tipo

In [10]:
datos.dtypes

nombres          object
fechas           object
saldo           float64
al corriente       bool
dtype: object

In [11]:
datos2 = datos.astype(str)
datos2.dtypes

nombres         object
fechas          object
saldo           object
al corriente    object
dtype: object

In [17]:
datos2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombres       4 non-null      object
 1   fechas        4 non-null      object
 2   saldo         4 non-null      object
 3   al corriente  4 non-null      object
dtypes: object(4)
memory usage: 256.0+ bytes

In [18]:
datos2

          nombres      fechas    saldo al corriente
0    Carlos Ayala  1995-12-21   3600.0         True
1  Martha Sánchez  1989-01-13   7452.0         True
2     Jimena Ríos  1992-09-14      nan        False
3     Raul Quiroz  1993-07-08  12143.5         True

In [19]:
datos2['saldo'].astype('float')

0     3600.0
1     7452.0
2        NaN
3    12143.5
Name: saldo, dtype: float64